---
type: IExternalResourceUIServer
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# IExternalResourceUIServer

`Autodesk.Revit.UI.IExternalResourceUIServer` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDBServerId | 2015 | `Guid GetDBServerId ()` |
| Method | HandleBrowseResult | 2015 | `void HandleBrowseResult ( ExternalResourceUIBrowseResultType resultType , string browsingItemPath )` |
| Method | HandleLoadResourceResults | 2015 | `void HandleLoadResourceResults ( Document document , IList < ExternalResourceLoadData > loadData )` |